{"page":"Texas San Antonio","page_id":"75528704","share_type":"discussion","created":"2010-09-11T21:12:22-07:00","createdBy":"support","title":"aff","description":"aff begins w\/ a narrative from Abner Louima, an immigrant who was raped and tortured by cops.<br \/>\n<br \/>\nHow do we deal with that which denies all description—the loss of a loved one, abuse, war, violence so shocking that it resists representation? How did we deal with the reality of September 11th, 2001? We sat transfixed to a screen, unable to speak. The rape and torture of Abner Louima produces this same result in the lives of privileged American citizens—we sit stunned when the significance of this event collides with the stories we tell ourselves about our way of life every day.  <br \/>\n<br \/>\nTrauma is the realization that the community to which we belong is founded on a lie…that to provide us with prosperity, our social order will go so far as to rape, torture, and murder. Yet this realization is not inevitable upon hearing Abner’s story: our notions of citizenship have become entangled with whiteness, and it is through our exclusive notion of national identity that we justify the inequality we see everyday.<br \/>\n<br \/>\nCarrillo-Rowe, Asst. Prof. of Rhetoric @ U of Iowa, 2004<br \/>\n(Aimme, “Whose ‘America?’ The Politics of Rhetoric and Space in the Formation of U.S. Nationalism,” Radical History Review, Spring, pg. 115-134, MUSE)<br \/>\nThe white nation...forms of belonging.<br \/>\n<br \/>\nIt is here between silence and speaking that the resolution speaks to us. Each year we encounter a resolution from a community of our peers. It is meant to ground a debate into a set parameter and construct an ideal predictable, researchable set of arguments in order to create a stable debate. Each year we grapple with its meaning, never touching the surface of the entirety of the resolution. We make it submit to our idea of how the story of a debate should be told by objective policy analysts. Against this tradition we affirm the trauma of the resolution and speak the betrayal of our very community:<br \/>\n<br \/>\nResolved: the United States Federal Government should substantially increase the number of and\/or substantially expand beneficiary eligibility for its visas for one or more of the following: employment-based immigrant visas, nonimmigrant temporary worker visas, family-based visas, human trafficking-based visas.<br \/>\n<br \/>\nAgainst the idea of a perfect set of language games to affirm the resolution we assert the un-speak-ability of the resolution. Our affirmation is a bearing witness to trauma and the inability to speak the reality of the world—it is a respect for difference and alterity within the resolution and is a solidarity with the stories unable to be explicated on by the immigrant survivors of exploitation and oppression. This is our witnessing of Abner’s torture. <br \/>\n<br \/>\n<br \/>\nAbner’s testimony into question the civility of our social order. Yet against the potential of Abner’s traumatic experience to shatter our sense of racial purity and victimhood, there is a desire to keep his experience a secret. Instead, we think of violence against immigrants as isolated incidents perpetrated by anomalous monsters.  <br \/>\n<br \/>\nIoanide, prof. of comparative ethnic studies @ Ithaca &amp; American Assoc. of Univ. Women Fellow, 2007<br \/>\n(Paula, “Story of Abner Louima: Cultural Fantasies, Gendered Racial Violence, and the Ethical Witness,” Journal of Haitian Studies, Spring, MUSE)<br \/>\n<br \/>\nA few years ago..excluded groups.<br \/>\n<br \/>\nOur ideal community and the American Dream is built upon the ongoing exploitation of the 3rd World. Ironically, the conditions that enable our dream are responsible for migration to the United States. Against this influx of immigrants, we think of ourselves as victims, and immigrants as those who would dare to ask us to share our wealth. It is our willed dismissal of their narratives that justifies tighter restrictions on border crossing as well as the ongoing exploitation and oppression of the 3rd World for our economic benefit.<br \/>\n<br \/>\nCarrillo-Rowe, Asst. Prof. of Rhetoric @ U of Iowa, 2004<br \/>\n(Aimme, “Whose ‘America?’ The Politics of Rhetoric and Space in the Formation of U.S. Nationalism,” Radical History Review, Spring, pg. 115-134, MUSE)<br \/>\n<br \/>\nIf whiteness ... this contradiction.<br \/>\n<br \/>\nThe stories we tell ourselves shape our identity—the same is true of our nation. As subjects who fear contingency and flux, we attempt to maintain coherence through an adherence to a static national identity. Against the trauma that calls our social order into question, we seek ways to enframe and control its fragmentary effect: by enframing it, depoliticizing it, or dehumanizing its author altogether. <br \/>\n<br \/>\n<br \/>\nEdkins, Senior lecturer in international politics at the University of Wales Aberystwyth, 2003 <br \/>\n(Jenny, Trauma and the Memory of Politics, Page 11-16)<br \/>\n<br \/>\nIn the psychoanalytic ...symbolic order.<br \/>\n<br \/>\nBy bearing witness, we seek to constantly interpret the affects of others, even those who were once considered objects incapable of expression through their oppression. Abner’s story reveals the way in which oppression forecloses the subjectivity of its victims—yet by witnessing his testimony, we move beyond his objectification, we do not see his story ending with a static meaning that can be possessed and easily interpreted or accommodated. By conceiving of his testimony as living, we witness his subjectivity in his capacity to speak against the systems of violence that once attempted to silence him. <br \/>\n<br \/>\nOliver, Chair of Philo. And Prof. of Women’s Studies at Vanderbilt, 2000<br \/>\n(Kelly, “Witnessing Subjectivity,” in Ipseity and Alterity: Interdisciplinary Approaches to Intersubjectivity, ed. Gallagher &amp; Watson, pg. 185-189)<br \/>\n<br \/>\nI suggest ... beyond recognition.<br \/>\n<br \/>\nOur relationship to the testimony of Louima’s torture is not that of voyeuristic fascination—unlike passive viewers, our affirmation is founded on the epistemic break inherent in the process of ethical witnessing. His torture has the potential to function as an ethical catalyst that rips apart our understanding of the existing social order and calls on us to change the material conditions that make it possible. <br \/>\n<br \/>\nIoanide, prof. of comparative ethnic studies @ Ithaca &amp; American Assoc. of Univ. Women Fellow, 2007<br \/>\n(Paula, “Story of Abner Louima: Cultural Fantasies, Gendered Racial Violence, and the Ethical Witness,” Journal of Haitian Studies, Spring, MUSE)<br \/>\n<br \/>\nIn &quot;Theses ... unjustifiable.<br \/>\n<br \/>\nThese cultural fantasies reveal the predominance of an exclusive national identity—one constructed on the myth of racial purity. These narratives of purity shape the material conditions of immigrants: citizenship becomes a way of differentiating access to privilege along racial lines. Immigrant bodies become terrifying and are violently subjected to white authority—Abner’s story reveals the way in which racial oppression is literally written upon the other’s body when it fails to meet our cultural ideal.<br \/>\nOur belief in our community and the American Dream is shattered when we strip away its accepted meaning and reveal the violence beneath—to show our community of privilege as constituted through exploitation and intimidation of immigrant communities. <br \/>\n<br \/>\nIoanide, prof. of comparative ethnic studies @ Ithaca &amp; American Assoc. of Univ. Women Fellow, 2007<br \/>\n(Paula, “Story of Abner Louima: Cultural Fantasies, Gendered Racial Violence, and the Ethical Witness,” Journal of Haitian Studies, Spring, MUSE)<br \/>\n<br \/>\nTo understand ... Haitian-American crowd","replies":[]}