{"page":"help.wikitext","page_id":"75774952","share_type":"discussion","created":"2009-10-14T21:23:15-07:00","createdBy":"support","title":"Elliott Abrams evidence on deterrence","description":"Elliott Abrams<br \/>\n&quot;Deterrence as moral response&quot;, Society, Volume 20, Number 6 \/ September, 1983, p. 28<br \/>\n<br \/>\nThese facts constitute a genuine paradox: the moral result of avoiding nuclear war was achieved through certain weapons. I believe we must face this paradox squarely. Many members of the antinuclear movement will not face it at all. These people argue that it is immoral even to have nuclear weapons. In the words of one churchman: &quot;It is morally wrong to threaten to use nuclear weapons as a deterrent.&quot; But the very purpose of a nuclear deterrent is to prevent nuclear war. This argument--that deterrence is morally wrong-- is tantamount to saying that the avoidance of the immoral is immoral.<br \/>\n<br \/>\nSuch reasoning would finally sever the link between morality and human reason. It is simplistic because it ignores half of morality--that the good man must be concerned about achieving a good result through his actions. It is based on an extreme exaggeration of the morality of intention, and it flies in the face of the moral experience of our country. When we try to decide whether it is right to use nuclear weapons and nuclear deterrence to prevent nuclear war, we face a dilemma similar to that faced by opponents of slavery in the 1840s. They had to decide whether it was right to prevent the extension of slavery by voting for Henry Clay, a slaveholder. The extreme abolitionists argued on the basis of the principle &quot;We are not to do evil that good may come.&quot; To this argument Abraham Lincoln wrote to the abolitionist Williamson Durley:<br \/>\n<br \/>\n&quot;This general proposition is doubtless correct; but did it apply? If by your votes you could have prevented the extension ... of slavery would it not have been good, and not evil, so to have used your votes, even though it involved the casting of them for a slaveholder? By the fruit the tree is to be known. An evil tree cannot bring forth good fruit.<br \/>\n<br \/>\nAt any given time, it is hard to know who is right in such a dilemma. But in retrospect we know that Lincoln was right. The extreme abolitionist position was as highly moral as it was impractical, and it was Lincoln who succeeded in freeing black Americans from bondage. The same sort of choice faces members of the antinuclear movement today. Theirs is the choice between a moralism that is ultimately self-indulgent, on the one hand, and working with their government to devise practical steps that will prevent nuclear war, on the other.","replies":[]}