{"page":"Florida State","page_id":"45077599","share_type":"discussion","created":"2009-09-18T17:42:48-07:00","createdBy":"support","title":"The Aff.","description":"Imaginary world of debate is in crisis of sublimation. Attempts to encounter the real of politics give fals value to a form of debate which substitutes “real action” with role playing. Key to any acto f solvency is realizing the valuelessness of debate and the extent to which it subverts our passions and abilities to break free of capitalism<br \/>\nZupancic 03 The shortest shadow: nietzsche’s philosophy of the two.<br \/>\n<br \/>\nCapitalism uses debaters to reify hegemony<br \/>\nSpanos 93 The end of education: toward posthumanism<br \/>\n<br \/>\nState power uses debate and education t teach us to play with politics as fantasy and to always have to operate within its given framework<br \/>\nSarup 84 Marxism\/structuralism\/education: theoretical developments the sociology of education p1-2<br \/>\n<br \/>\nCapitalisms disciplinary gaze ensures violence<br \/>\nSpanos 93<br \/>\n<br \/>\nCapitalism causes technorational thought<br \/>\nSpanos 93<br \/>\n<br \/>\nZero point<br \/>\nDillon 99<br \/>\n<br \/>\nMyth of western progress is root of destruction<br \/>\nSpanos 93<br \/>\n<br \/>\nNo value to life<br \/>\nDebord 77 society of the spectacle<br \/>\n<br \/>\nIndividual rejection solves<br \/>\nRoszak 92 The voice of the earth p315-17<br \/>\n<br \/>\nNihilism inevitable<br \/>\nZupancic 03<br \/>\n<br \/>\nActive nihilism key<br \/>\nZupancic 03<br \/>\n<br \/>\nCritical to our embracing o factive nihilism is knowing which enemy to fight<br \/>\nHardt and negri, empire,<br \/>\n<br \/>\nRole o fballot is to use the ballot as means of production against capitalism<br \/>\nStone www.by.edu\/wcp\/Papers\/Soci\/SociSton.htm<br \/>\n“capitalism is both an” AND “provides no proof”<br \/>\n<br \/>\nDiscursive activities such as debate are crucial to expose hidden assumptions<br \/>\nPacheco 78 Philosophy of education p219","replies":[]}