{"page":"Concordia CM AFF (Ian Cero & Mason Maxwell) 08","page_id":"24604857","share_type":"discussion","created":"2007-10-14T08:17:30-07:00","createdBy":"support","title":"Concordia CM - KCKCC","description":"Observation 1 is the Location<br \/>\n<br \/>\nA. In the status quo, American rhetoric about the Middle East deludes us into thinking that the Arab-Israeli conflict is happening somewhere far away. This is incorrect - The violent Rhetoric of the Arab Israeli conflict is happening right here and right now.<br \/>\nKhawaja , 2003. (Irfan, Instructor of Philosophy at John Jay College of Criminal Justice Oct 3, “Muslim Anti-Semitism and Zionist Orientalism: The Workings of a Vicious Cycle,” On Formation and Renewal, Notre Dame. <!-- ws:start:WikiTextUrlRule:47:http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc --><a class=\"wiki_link_ext\" href=\"http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc\" rel=\"nofollow\">http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc<\/a><!-- ws:end:WikiTextUrlRule:47 -->.<br \/>\n<br \/>\n<br \/>\nB. The discursive conflict around Israel and Palestine starts in the American academy, but it doesn’t stay there. Intellectual Zionist rhetoric trickles down to “street” speech where it does its damage in the form of arguments for extermination of the Palestinians. The connection between intellectual and street discourse is living and real, in our institutions.<br \/>\nKhawaja , 2003. (Irfan, Instructor of Philosophy at John Jay College of Criminal Justice Oct 3, “Muslim Anti-Semitism and Zionist Orientalism: The Workings of a Vicious Cycle,” On Formation and Renewal, Notre Dame. <!-- ws:start:WikiTextUrlRule:48:http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc --><a class=\"wiki_link_ext\" href=\"http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc\" rel=\"nofollow\">http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc<\/a><!-- ws:end:WikiTextUrlRule:48 -->.<br \/>\n<br \/>\n<br \/>\nC. In the academy, the charge of anti-Semitism has been expanded to any criticism of Israel. This silences productive discourse and makes it impossible to asses what is and is not anti-Semitic. <br \/>\nButler, 2004 - (Judith, Professor of English and Rhetoric at Berkeley, Precarious Life, p102)<br \/>\n<br \/>\nObservation 2 – The Charge<br \/>\n<br \/>\nA. In the academy, yet another accusation of anti-Semitism is being deployed. These recent claims of a “new anti-Semitism” are designed to exploit the historical suffering of Jews and immunize Israel from scrutiny.<br \/>\nFinklestein, 2005. Professor of PoliSci at DuPaul U. Beyond Chutzpah, pg 21-22)<br \/>\n<br \/>\n<br \/>\nB. This discourse around anti-Semitism re-envisions any critique of Israel as anti-Semitic by attributing prejudice to the speaker. The criticism is thus treated not as a productive discourse, but seen instead as a cloak for discrimination against Jews.<br \/>\nButler, 2004 - (Judith, Professor of English and Rhetoric at Berkeley, Precarious Life, p102)<br \/>\n<br \/>\n<br \/>\nC. These charges are carry extreme weight. Anyone with any proposal to change status-quo Israel is accused of wishing to destroy all Jews. This is a flawed argument for four reasons.<br \/>\nKhawaja , 2003. (Irfan, Instructor of Philosophy at John Jay College of Criminal Justice Oct 3, “Muslim Anti-Semitism and Zionist Orientalism: The Workings of a Vicious Cycle,” On Formation and Renewal, Notre Dame. <!-- ws:start:WikiTextUrlRule:49:http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc --><a class=\"wiki_link_ext\" href=\"http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc\" rel=\"nofollow\">http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc<\/a><!-- ws:end:WikiTextUrlRule:49 -->.<br \/>\n<br \/>\n<br \/>\nD. The accusation of a desire to kill all Jews treats any critic of Israel, whether academic or terrorist, as an unjust enemy whose moral maxim makes peace impossible.<br \/>\n<br \/>\nE. This leads to Extinction. As great Carl Schmidt is, he is wrong. Constructing enemies as unjust breaks down the safeguards of sovereignty and law, Schmidt’s construction of the enemy breaks down the law, which breaks down the concept of the friend. This throws humanity into total war without limits and creates an absolute threat to humanity.<br \/>\nMoreiras, Director of European Studies at Duke, 2k4 (Alberto, “A God without Sovereignty. Political Jouissance. The Passive Decision”, CR: The New Centennial Review 4.3, p.81-83, Project MUSE) <br \/>\n<br \/>\n<br \/>\nF. Don’t be fooled into thinking its for the better good. This interpretation of Anti-Semitism, which has protected Israel from kritik has actually produced real anti-Semitism against not just Israel, but Jews more broadly.<br \/>\nFinklestein, 2005. Professor of PoliSci at DuPaul U. Beyond Chutzpah, pg 21-22)<br \/>\nThus we advocate the following: charges of anti-Semitism should be rejected as a legitimate defense of Israel and its policy choices. <br \/>\nObservation 3 - Solvency<br \/>\n<br \/>\nRejecting the use of anti-Semtitism as a legitimate substitute for critique is key to opening a space for productive public discourse and a more dynamic identity for Jews.<br \/>\nButler, 2004 - (Judith, Professor of English and Rhetoric at Berkeley, Precarious Life, p125)<br \/>\n<br \/>\n<br \/>\nIndividual resistance to the charge of anti-Semitism is the first step to solving the crisis in discourse.<br \/>\nKhawaja , 2003. (Irfan, Instructor of Philosophy at John Jay College of Criminal Justice Oct 3, “Muslim Anti-Semitism and Zionist Orientalism: The Workings of a Vicious Cycle,” On Formation and Renewal, Notre Dame. <!-- ws:start:WikiTextUrlRule:50:http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc --><a class=\"wiki_link_ext\" href=\"http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc\" rel=\"nofollow\">http:\/\/ethicscenter.nd.edu\/archives\/documents\/IrfanKhawaja.doc<\/a><!-- ws:end:WikiTextUrlRule:50 -->.<br \/>\n<br \/>\n-Cooptation arguments are wrong. Even if co-opted in part, our case will not be completely co-opted. <br \/>\n-And, Turn: the risk of cooptation is why we have a responsibility to change the conditions under which criticism is received by the audience.<br \/>\nButler, 2004 - (Judith, Professor of English and Rhetoric at Berkeley, Precarious Life, p102)","replies":[]}