{"page":"Baylor Aff","page_id":"24604209","share_type":"discussion","created":"2006-11-10T20:18:42-08:00","createdBy":"support","title":"i dont know how else to post it","description":"Traditional debate practices call us to define the resolution, to interpret the resolution and then to affirm the resolution in that statement, that actuality. We use our intelligence and research to master the topic, limit the topic and give the topic meaning. It’s the affirmative’s job to turn every no into a yes, and the negative dances the same jig in reverse. And with this mastery and intelligence we attempt to know the resolution, and say that we have learned the resolution. <br \/>\n<br \/>\n“Intelligence, Give me,” by Juan Ramon Jimenez:<br \/>\n<br \/>\nIntelligence, Give Me<br \/>\nThe exact name of things<br \/>\n… I want my word to be<br \/>\nThe thing itself<br \/>\nCreated by my soul a second time<br \/>\nSo that those who do not know them<br \/>\nCan go to the things through me<br \/>\nAll those who have forgotten them<br \/>\nAll those who love them<br \/>\nCan go to the things through me…<br \/>\nIntelligence, give me<br \/>\nThe exact name, and your name<br \/>\nAnd theirs and mine, for things!<br \/>\n<br \/>\nHold on now, this is bullshit! I mean, I’m a pretty smart guy and I can usually understand things, but I can’t ever tell what “the thing itself” actually is, precisely. For in some way, my description of a thing never seems to capture the thing itself, it’s always somehow missing. This isn’t anything more than the same problem humanity has been facing forever. We seem to be social creatures and cannot act, exist, or think without language. Language is the way we communicate, but it is imperfect. No description can ever really capture all of what is; yet we refuse to even admit this.<br \/>\n<br \/>\nSo where does this leave us, those who seek to affirm in a world that we cannot master? Certainly, we have found ourselves in a destitute time. And what is it that is so destitute about this age? Put simply, humanity has lost its gestures. Our capacity to truly communicate has been lost. That’s not to say that we can no longer speak anymore, but what was really at the heart of communication has all been presupposed. Language has been utterly sterilized, stripped of its <br \/>\n<br \/>\n<br \/>\npotential to simultaneously reveal and hide itself, so that we may seek comfort in the idea that we can achieve Truth. By our own choices we have removed the possibility of engaging in pure communication. The active refusal to seek the thing itself in language cripples our ability to experience authentic community and communication. We have come to presuppose the thing itself within language.<br \/>\n<br \/>\nHow can we conceive of such a thing in language, the thing itself of language? <br \/>\n<br \/>\nTo help us understand, we should back the story up a bit, way back, all the way to Plato and Aristotle<br \/>\n<br \/>\nYou see, Plato spent a lot of time contemplating being. For every being and every thing, Plato discovered five things: the name, the definition, the image, the knowledge of the thing, and the thing itself. For Plato, the thing itself is very much a real thing. It exists as that by which the name, definition, and image of a thing is revealed and thus by which knowledge of a thing becomes possible. It was therefore that part of being within the world that came to be known to humanity only through language, yet that language was always insufficient to describe, and master. This is because the thing itself conceals itself within language. When we speak about things without presupposing the thing itself, things in the world communicate themselves through our language. The reason why we cannot master language is simply because the very muse and inspiration of our language simultaneously hides and reveals itself. The thing itself is the part of being, of every being, that communicates and reveals itself.  Thus, the thing itself is at the heart of communication. <br \/>\n<br \/>\nOn the other hand, you have Aristotle, the great granddaddy of Western logic. Aristotle’s idea of language and existence eliminated the thing itself entirely from language. For Aristotle our name and linguistic signification of a thing, our knowledge of a thing, and the sensible object of the thing, were entirely compartmentalized. There was no thing itself in this logic, to express itself through language. For him, the human capacity to master and define would be sufficient. Thus, the letter, the written definite linguistic signification becomes the final interpreter of language, giving language a definite and absolute meaning, or more precisely, commanding language to its finite and absolute meaningfulness, while simultaneously creating the essential foundation of truth, rationality, and logic. <br \/>\n<br \/>\nSo what does it mean to remove the thing itself from language? Let’s remember the thing itself as that which communicates only itself in language. Being thus participates in out language, has a role in our language, dwells in our language. When we remove the thing itself in language, by forcing language into a one-dimensional disclosure, we presuppose and obscure being, thus reifying language’s command over being. <br \/>\n<br \/>\nA world that can be so easily defined may also be mastered, or at least objectified. This self-assertion and domination over being founds limitless violence.<br \/>\n<br \/>\nHeidegger ’71 [Martin, Late Prof. of Philosophy at Marburg and Frieburg. Poetry, Language, Thought. Translated by Albert Hofstadter, Prof. emeritus of philosophy at Columbia University and the University of California at Santa Cruz. Pg. 107-110&gt;<br \/>\n<br \/>\nAnd so we find ourselves in a destitute time. For this technological thought implicates us all in out daily lives. Every form of exclusion, domination, and dichotomization is founded on the creation of truth in language. For example, in infant America’s dreams of liberty, who received the freedom of our founding fathers depended largely on who was considered the we in “we the people.”<br \/>\n<br \/>\nThe difference between “dejure” and “defacto” segregation determined which hoods got to be equally protected.<br \/>\n<br \/>\nA young girl died because a court deiced that making her tell her abusive father before she got an abortion wasn’t an “undue burden.” <br \/>\n<br \/>\nSome people have been moved indefinitely to U.S. military bases because they have been defined as “enemy combatants.”<br \/>\n<br \/>\nThe Supreme Court determines who will and will not receive federal protection from violence depending on whether such violence “substantially affects interstate commerce.”<br \/>\n<br \/>\nThe Supreme Court  gives is final ruling on the language of the law, and in the same way, we in debate call on the judge to make a sovereign decision on the resolution. What founds all of these modes of sovereign thought is simple: the presupposition of the thing itself from language. Our mode of technological thought and truth production has granted sovereign dominant powers the capacity to make the final decision on language. We have enslaved ourselves to language. <br \/>\n<br \/>\nIs it possible, then, for us to liberate ourselves from the prison house of language? <br \/>\n<br \/>\nIs it possible for humanity to regain its gestures? <br \/>\n<br \/>\nHow can we return to the thing itself to language, or more specifically, how may we allow the thing itself to be revealed in out language, yet conceal itself, to remain comfortably hidden? <br \/>\n<br \/>\nThere is a hope for a pure language, returning the thing itself to language, and freeing us from technologized calculative thought. <br \/>\n<br \/>\nTo think and speak in such a way requires us to dwell near being, to “memorialize and respond” to being. <br \/>\n<br \/>\nHeidegger describes the task of the more venturous amongst us as the task of the poet. <br \/>\n<br \/>\nTo let the thing itself reveal itself in our language is to speak poetically, not in terms of rhyme or structure, but in the way that poetry communicates itself outside of any sovereign meaning. <br \/>\n<br \/>\nA poet speaks language itself.<br \/>\n<br \/>\n---<br \/>\nWhat is the role of a poet in a destitute time?<br \/>\n<br \/>\nWho are the poets, who shall they be?<br \/>\n<br \/>\nWho shall venture nearest with us to where being dwells?<br \/>\nIn language<br \/>\n<br \/>\nAnd who shall help to speak this community<br \/>\nInto something better<br \/>\n<br \/>\nSomething still to come.<br \/>\n<br \/>\nThe poets speak:<br \/>\n<br \/>\nResolved: The Unites States Supreme Court should overrule one or more of the following decisions: Planned Parenthood v. Casey, Ex parte Quirin, U.S. v. Morrison, Milliken v. Bradley. <br \/>\n---<br \/>\n<br \/>\nWe affirm the resolution as poetry, as language that does not signify anything except itself, anything except communication. Thus, we actualize language as pure potentiality, the ability to simultaneously be and not be. Only by speaking language as poetry, as potential to not signify anything, do we displace language from the register of affirmation and negation, and return the thing itself to language.<br \/>\n<br \/>\nRoazen ’99 [Daniel Heller, Prof. of Poetics, Medieval Studies, History of Philosophy at Princeton University. Ed. Potentialities by Giorgio Agamben (Introduction). Pg. 15-19]<br \/>\n<br \/>\n<br \/>\nPhilosophy must confront the existence of language, and the thing itself within language. Humanity is in crisis with language, we’ve recognized that we’re imprisoned by language, but cannot free ourselves from it. Vote for our communicative gesture because it reveals the thing itself within the resolution, and helps lead our community to form around authentic human communication.<br \/>\n<br \/>\nAgamben ’99 [Giorgio, Prof. at the University of Verona. Potentialities: Collected Essays in Philosophy. Ed. By Wrener Hamacher, David E. Wellbery, and Daniel Heller Roazen. Pg. 45-47]","replies":[{"user":"support","created":"2006-11-10T22:19:22-08:00","body":"Reposted on the Baylor page under &quot;Baylor MR Pre-Shirley&quot;"}]}